Repository: raccoongang/xblock-lti-consumer
Catalog: lti_consumer/translations/*/LC_MESSAGES/text.po
Languages: pt_br

source: No valid user id found in endpoint URL
pt_br: Nenhuma ID de usuário válido encontrada no ponto de extremidade da URL

source: Display Name
pt_br: Nome de exibição

source: Enter the name that students see for this component. Analytics reports may also use the display name to identify this component.
pt_br: Forneça o nome que os alunos verão para este componente. Os relatórios de análise também poderão usar o nome de exibição para identificar este componente.

source: LTI Consumer
pt_br: Consumidor de LTI

source: LTI Application Information
pt_br: Informações do aplicativo LTI

source: Enter a description of the third party application. If requesting username and/or email, use this text box to inform users why their username and/or email will be forwarded to a third party application.
pt_br: Forneça uma descrição do aplicativo de terceiros. Caso esteja solicitando nome de usuário e/ou e-mail, use esta caixa de texto para informar aos usuários por que seus nomes de usuário e/ou e-mails serão encaminhados para um aplicativo de terceiros.

source: LTI ID
pt_br: ID do LTI

source: Enter the LTI ID for the external LTI provider. This value must be the same LTI ID that you entered in the LTI Passports setting on the Advanced Settings page.<br />See the {docs_anchor_open}edX LTI documentation{anchor_close} for more details on this setting.
pt_br: Forneça a ID de LTI do fornecedor externo de LTI. A ID de LTI deve ser igual à fornecida nas configurações do passaporte de LTI na página de Configurações Avançadas.<br />Leia a {docs_anchor_open}documentação de LTI do edX{anchor_close} para mais detalhes sobre esta configuração.

source: LTI URL
pt_br: URL do LTI

source: Enter the URL of the external tool that this component launches. This setting is only used when Hide External Tool is set to False.<br />See the {docs_anchor_open}edX LTI documentation{anchor_close} for more details on this setting.
pt_br: Forneça a URL da ferramenta externa iniciada por esse componente. Esta configuração só é usada quando a ferramenta de ocultação externa é definida como Falso.<br />Leia a {docs_anchor_open}documentação de LTI do edX{anchor_close} para mais detalhes sobre esta configuração.

source: Custom Parameters
pt_br: Parâmetros de personalização

source: Add the key/value pair for any custom parameters, such as the page your e-book should open to or the background color for this component. Ex. ["page=1", "color=white"]<br />See the {docs_anchor_open}edX LTI documentation{anchor_close} for more details on this setting.
pt_br: Adicione a chave/valor do par de cada parâmetro personalizado, tais como a página em que o e-book deve abrir or a cor de plano de fundo deste componente. Exemplo: ["page=1", "color=white"]<br />Leia a {docs_anchor_open}documentação de LTI do edX{anchor_close} para mais detalhes sobre esta configuração.

source: LTI Launch Target
pt_br: Destino de início do LTI

source: Select Inline if you want the LTI content to open in an IFrame in the current page. Select Modal if you want the LTI content to open in a modal window in the current page. Select New Window if you want the LTI content to open in a new browser window. This setting is only used when Hide External Tool is set to False.
pt_br: Selecione Em linha, se deseja que o conteúdo de LTI seja aberto em iFrame na página atual. Selecione Modal se deseja que o conteúdo de LTI seja aberto em uma janela modal na página atual. Selecione Nova janela, caso deseje que o conteúdo de LTI seja aberto em uma nova janela do navegador. Esta configuração só é usada quando a ferramenta de ocultação externa é definida como Falso.

source: Button Text
pt_br: Texto do botão

source: Enter the text on the button used to launch the third party application. This setting is only used when Hide External Tool is set to False and LTI Launch Target is set to Modal or New Window.
pt_br: Forneça o texto no botão usado para iniciar o aplicativo de terceiros. Esta configuração só é usada quando a ferramenta de ocultação externa é definida como Falso e o destino de início do LTI é definido como Modal ou Nova janela.

source: Inline Height
pt_br: Altura do embutido

source: Enter the desired pixel height of the iframe which will contain the LTI tool. This setting is only used when Hide External Tool is set to False and LTI Launch Target is set to Inline.
pt_br: Forneça a altura de pixel do iFrame desejada que contém a ferramenta de LTI. Esta configuração só é usada quando a ferramenta de ocultação externa é definida como Falso e o destino de início do LTI é definido como Embutido.

source: Modal Height
pt_br: Altura do modal

source: Enter the desired viewport percentage height of the modal overlay which will contain the LTI tool. This setting is only used when Hide External Tool is set to False and LTI Launch Target is set to Modal.
pt_br: Forneça a porcentagem de altura do visor da sobreposição modal desejada que contém a ferramenta de LTI. Esta configuração só é usada quando a ferramenta de ocultação externa é definida como Falso e o destino de início do LTI é definido como Modal.

source: Modal Width
pt_br: Largura do modal

source: Enter the desired viewport percentage width of the modal overlay which will contain the LTI tool. This setting is only used when Hide External Tool is set to False and LTI Launch Target is set to Modal.
pt_br: Forneça a porcentagem da largura do visor do modal de sobreposição desejada que contém a ferramenta de LTI. Esta configuração só é usada quando a ferramenta de ocultação externa é definida como Falso e o destino de início do LTI é definido como Modal.

source: Scored
pt_br: Pontuado

source: Select True if this component will receive a numerical score from the external LTI system.
pt_br: Selecione Verdadeiro se este componente for receber uma pontuação numérica do sistema LTI externo.

source: Enter the number of points possible for this component. The default value is 1.0. This setting is only used when Scored is set to True.
pt_br: Entre com o número de pontos possíveis para este componente. O valor padrão é 1.0. Esta configuração só é usada quando a opção "Pontuável" estiver marcada como Verdadeiro.

source: The score kept in the xblock KVS -- duplicate of the published score in django DB
pt_br: A pontuação utilizada no xblock KVS - cópia da pontuação publicada no BD do django.

source: Comment as returned from grader, LTI2.0 spec
pt_br: Comentário conforme o retorno do avaliador, específico do LTI2.0

source: Hide External Tool
pt_br: Ferramenta de ocultação externa

source: Select True if you want to use this component as a placeholder for syncing with an external grading system rather than launch an external tool. This setting hides the Launch button and any IFrames for this component.
pt_br: Selecione Verdadeiro caso deseje utilizar este componente como um espaço reservado para sincronização com um sistema de avaliação externo ao invés de iniciar uma ferramenta externa. Esta configuração oculta o botão Iniciar e quaisquer iframes deste componente.

source: Accept grades past deadline
pt_br: Aceitar notas após o prazo final

source: Select True to allow third party systems to post grades past the deadline.
pt_br: Selecione Verdadeiro para permitir que sistemas de terceiros possam postar notas fora do prazo.

source: Request user's username
pt_br: Exigir o nome de usuário

source: Select True to request the user's username.
pt_br: Selecione Verdadeiro para solicitar o nome de usuário.

source: Request user's email
pt_br: Exigir o endereço de e-mail do usuário

source: Select True to request the user's email address.
pt_br: Selecione Verdadeiro para solicitar o endereço de e-mail do usuário.

source: Could not parse LTI passport: {lti_passport}. Should be "id:key:secret" string.
pt_br: Não foi possível analisar o passaporte LTI: {lti_passport}. Deve ser uma string "id:key:secret".

source: Could not get user id for current request
pt_br: Não foi possível obter a ID de usuário para a solicitação atual

source: Could not parse custom parameter: {custom_parameter}. Should be "x=y" string.
pt_br: Não foi possível analisar o parâmetro personalizado: {custom_parameter}. Deve ser uma sequência "x=y".

source: [LTI]: Real user not found against anon_id: {}
pt_br: [LTI]: usuário real não encontrado em anon_id: {}

source: Please provide launch_url. Click "Edit", and fill in the required fields.
pt_br: Por favor, forneça o launch_url. Clique em "Editar" e preencha os campos obrigatórios.
